PROCEDURE DIVISION.
sec-one SECTION.
	PARA-NAME-ZERO.
		IF ten > ten
		MOVE x TO Y 
		ADD x TO z
		DIVIDE ten INTO five ROUNDED
		DIVIDE 2.2 INTO ten
		MULTIPLY my-val BY my-val-2 my-val-2 ROUNDED.
		IF x > y
			PERFORM PARA-NAME-ONE THROUGH PARA-NAME-TWO. 
	PARA-NAME-ONE. 
		ADD two TO three 
		IF one > five
			ADD 10 TO five
		ELSE
			MOVE five TO ten
			ADD ten TO six
			PERFORM PARA-NAME-FIVE.
	PARA-NAME-TWO. 
		ADD two TO three
		SUBTRACT three FROM two 
		IF one > five
			MOVE two TO three
		ELSE
			ADD two TO five
			PERFORM PARA-NAME-ZERO THROUGH PARA-NAME-FIVE. 
	PARA-NAME-THREE.
		IF 5 GREATER y 
			ADD two TO three 
			IF one > five
			ADD 1.1 TO ten.
	PARA-NAME-FOUR.
		IF 5 GREATER y 
			ADD two TO three 
			IF one > five
				ADD 1.1 TO ten
				PERFORM PARA-NAME-TWO.
	PARA-NAME-FIVE.
		MOVE ten TO five.
	PARA-NAME-SIX.
		PERFORM PARA-NAME-SEVEN.
		PERFORM PARA-NAME-EIGHT.
	PARA-NAME-SEVEN.
	PARA-NAME-EIGHT.